{
  "Brewfile.vim": { "branch": "master" },
  "ale": { "branch": "master" },
  "alpha-nvim": { "branch": "main" },
  "conflict-marker.vim": { "branch": "master" },
  "dark-notify": { "branch": "master" },
  "diffview.nvim": { "branch": "main" },
  "fzf": { "branch": "master" },
  "fzf.vim": { "branch": "master" },
  "hlargs.nvim": { "branch": "main" },
  "hop.nvim": { "branch": "master" },
  "lazy.nvim": { "branch": "main" },
  "lsp_signature.nvim": { "branch": "master" },
  "lualine.nvim": { "branch": "master" },
  "marks.nvim": { "branch": "master" },
  "neoscroll.nvim": { "branch": "master" },
  "nerdcommenter": { "branch": "master" },
  "nvim-autopairs": { "branch": "master" },
  "nvim-coverage": { "branch": "main" },
  "nvim-peekup": { "branch": "master" },
  "nvim-snippy": { "branch": "master" },
  "nvim-solarized-lua": { "branch": "master" },
  "nvim-surround": { "branch": "main" },
  "nvim-tabline": { "branch": "main" },
  "nvim-toggler": { "branch": "main" },
  "nvim-tree.lua": { "branch": "master" },
  "nvim-treesitter": { "branch": "master" },
  "nvim-web-devicons": { "branch": "master" },
  "other.nvim": { "branch": "main" },
  "plenary.nvim": { "branch": "master" },
  "rename.vim": { "branch": "master" },
  "sideways.vim": { "branch": "main" },
  "tabular": { "branch": "master" },
  "targets.vim": { "branch": "master" },
  "ticket.vim": { "branch": "master" },
  "undotree": { "branch": "master" },
  "urlview.nvim": { "branch": "main" },
  "vim-better-whitespace": { "branch": "master" },
  "vim-capslock": { "branch": "master" },
  "vim-characterize": { "branch": "master" },
  "vim-css-color": { "branch": "master" },
  "vim-fugitive": { "branch": "master" },
  "vim-gh-line": { "branch": "master" },
  "vim-gitgutter": { "branch": "main" },
  "vim-indent-object": { "branch": "master" },
  "vim-instant-markdown": { "branch": "main" },
  "vim-markdown": { "branch": "master" },
  "vim-matchup": { "branch": "master" },
  "vim-nestedtext": { "branch": "master" },
  "vim-repeat": { "branch": "master" },
  "vim-snippets": { "branch": "master" },
  "vim-speeddating": { "branch": "master" },
  "vim-unimpaired": { "branch": "master" },
  "vista.vim": { "branch": "master" }
}
