{
  "Brewfile.vim": { "branch": "master" },
  "alpha-nvim": { "branch": "main" },
  "dark-notify": { "branch": "master" },
  "fzf": { "branch": "master" },
  "fzf.vim": { "branch": "master" },
  "hop.nvim": { "branch": "master" },
  "lazy.nvim": { "branch": "main" },
  "lualine.nvim": { "branch": "master" },
  "marks.nvim": { "branch": "master" },
  "neoscroll.nvim": { "branch": "master" },
  "nerdcommenter": { "branch": "master" },
  "nvim-peekup": { "branch": "master" },
  "nvim-snippy": { "branch": "master" },
  "nvim-solarized-lua": { "branch": "master" },
  "nvim-surround": { "branch": "main" },
  "nvim-tabline": { "branch": "main" },
  "nvim-tree.lua": { "branch": "master" },
  "nvim-web-devicons": { "branch": "master" },
  "packer.nvim": { "branch": "master" },
  "rename.vim": { "branch": "master" },
  "undotree": { "branch": "master" },
  "urlview.nvim": { "branch": "main" },
  "vim-better-whitespace": { "branch": "master" },
  "vim-capslock": { "branch": "master" },
  "vim-characterize": { "branch": "master" },
  "vim-indent-object": { "branch": "master" },
  "vim-instant-markdown": { "branch": "main" },
  "vim-nestedtext": { "branch": "master" },
  "vim-repeat": { "branch": "master" },
  "vim-snippets": { "branch": "master" },
  "vim-speeddating": { "branch": "master" },
  "vim-unimpaired": { "branch": "master" }
}
